{"0": {"title": "Python / Backend Software Engineer", "description": "Datapeople helps recruiting teams make more thoughtful and accurate decisions about their recruiting process, from the job posts they write to the data they report on. We know that small changes can have big impacts and while we're very happy to serve some of the most forward-thinking talent teams on the planet including Twitch, BuzzFeed, and Oscar Health, at the heart of our mission is an absolute love for candidates and empathy for the challenges they face when trying to get a job.\n\nWe are looking for an experienced Python Software Engineer to help us develop data products that help recruiting teams understand and improve their hiring pipelines and processes. You'll work within the engineering team, reporting to our Head of Engineering.\n\nYou will:\n\nBuild scalable data pipelines that integrate multiple data sources (both internal as well as external APIs).\nCreate resilient data extraction and transformation processes with monitoring\nPrototype and productize data products and data models\nDevelop internal tools that will be used by the data and engineering teams\nCreate code that is maintainable and includes relevant tests. Maintain and advocate for these standards through code review within the engineering team.\n\nThis is a remote job and available to all candidates with work privileges currently residing in the United States.\n\nYou have:\n\n4 or more years of experience building large-scale software applications with Python\nWork experience with SQL and common relational database systems\nWork experience with debugging and optimizing data flows\nExperience with unit, functional, and performance testing\nPreferred: Experience using NoSQL databases (e.g. ElasticSearch)\nPreferred: Familiarity with containerized development workflows\nPreferred: Experience deploying data pipelines through AWS\n\nOur benefits:\n\nComprehensive healthcare plans\nFlexible PTO policy\n401k retirement plan\nCommuter benefits\nRemote-friendly team and open to more flexible work arrangements\n\nWe come to work every day with the mission of making opportunities more accessible and the recruiting process fairer for candidates. We're a remote-first company with linguists, engineers, and scientists working all across the United States.\n\nWe care deeply about fairness (it's our mission) so you can be ensured that your application will never be judged based on your religious belief, age, color, race, creed, marital status, gender, sexual orientation, political affiliation, ethnic origin, family status or disability."}, "1": {"title": "Python Developer", "description": "Dear Python Devs,\n\nA fast growing LA based Ecommerce Tech company is looking for Python developers in North America, South America and Europe. If you consider yourself a motivated Pythonist with plenty of initiative, we have the perfect job for you. We work with our Shuup eCommerce Platform. Shuup is Shopify with Steroids, and is used to build enterprise online marketplaces (such as Amazon and Grubhub) through which multiple vendors can sell physical or digital products and services.\n\nWe wish from you that:\nYou are confident in working with Django and you love writing Python language.\nYou know JavaScript and maybe some of its new trends and you’re not afraid to write CSS or HTML, either.\nYou are somewhat familiar with LESS, SASS, jQuery and ES6.\nYou are interested in software development as a craft and wish to grow as a developer.\n\nIn addition, we value\nExperience in agile software development methods.\nExperience from software development projects.\nYou wish to share your knowledge with other developers.\nPositive attitude and a willingness to learn.\nYou have experience or interest in E-Commerce.\nPrior experience in using open source technologies in software development.\nFluency in English.\n\nWhy Shuup?\nWe trust in Python and solution-oriented working. For every Shuuper, we plan an individual python programmer career path and support it along the way. We have a wide range of projects and we promise that you won’t get bored with us. We offer a competitive salary and other benefits. You may also choose to work either remotely or at the office, that is totally up to you.\n\nWhy us?\nOur success in the Great Place to Work studies tells a lot about how we feel about our employees. We will support your professional development in many ways and encourage employees also to participate in developing our company. When the organizational culture is being originated and nurtured by employees, it becomes authentic, honest and laid-back.\n\nWe offer\nAn interesting and motivated work environment with great co-workers\nThe opportunity to be a part of building an international success story\nInteresting and challenging projects – not just repetitive work!\nExtensive remote work possibilities"}, "2": {"title": "Senior Python Developer - Innovative Data Platform - $180k", "description": "A VC-Backed first-of-its-kind platform in the data domain is scaling out its founding engineering team to work fully remote in the US.\n\nThis company is using cutting edge technology to solve problems around the complexity of data and infrastructure for its rapidly growing client base.\n\nThe Job\nOwn the development of new features and support existing product\nDesign and then build backend features with internal stakeholders and future scalability in-mind\nInterface with analytical databases\n\nAbout You\n5+ years' experience in Backend software development and API design, the tech stack is Python3, Flask, PostgresSQL, Celery\nExperience working in a fast-growth startup\nAble to communicate ideas effectively\n\nPackage\nCirca $180k + equity + benefits\nFully remote"}, "3": {"title": "Python Developer", "description": "Job Title:  Python Developer\nLocation: 100% Remote\nIndustry: Real Estate Technology\nTerms: Permanent / Direct Hire\nPay Range:  $110,000 - $135,000 + benefits\nVisas & C2C: Not eligible\nSearch Criteria:\n\n6+ years of Python development\nProficiency with AWS (EC2, S3, RDS, Glue, Lambda, and Redshift)\nExperience with SQL and NoSQL data sources\nExperience with CI/CD tools (Git, Jenkins, Gitlab)\nKafka or similar data streaming tech (nice to have)\n\nJob Summary:\nSeeking a Python Developer to join one of the fastest growing real estate technology companies in the country. The heart of our growth is enabled by embracing an inclusive environment, encouraging individual development, rewarding innovative excellence, and supporting our community. As part of our team, you would be helping to seamlessly connect clients to their best real estate professionals and transform the US’s largest consumer industry. \n\nJob Duties:\nWork with business stakeholders, product owners, developers, and data scientists to design and develop high-quality software and data architectures for batch and streaming data pipelines\nResponsible for end-to-end delivery of data products, from architecture and design to implementation to maintenance and growth that serve Business intelligence and reporting\nPredictive algorithms and data mining\nStrategic and tactical research and analyses\nIdentify, prioritize, and execute tasks in the data engineering development life cycle\nDevelop tools and applications by producing clean, efficient code\nParticipate in code reviews and offer suggestions and guidance\nCollaborate across internal business teams and cross-functional stakeholders\nActively coordinate efforts with other internal development team\nHighly motivated and have a passion for creating and supporting great products\nGuide, coach, and mentor data engineering and analytics team members\n\nIdeal Background:\n6+ years of development experience including the ability to write expert-level, maintainable, and robust code using Python, SQL, and relational database.\n4+ years designing, accessing, and maintaining data warehouses; developing and maintaining ETL pipelines & dimensional data modeling\n3+ years with experience with AWS services, such as EC2, S3, RDS, Lambda, Glue, Step Functions, Athena, and Redshift\nExperience using source control (Git preferred)\nComfortable with CI/CD pipelines using tools like Jenkins, TravisCI, or GitLab Runners\nAgile team development experience\nBachelors degree and 6+ years of experience or Master’s degree and 3+ years of experience"}, "4": {"title": "Sr. Python Developer (100% Remote)", "description": "Position Sr. Python or Java developer with strong Database Exp.\n\nDuration Long term\n\nLocation NYC\n\nRemote work until covid clears\n\nLookout for Sr.Python or Java developers with a very strong database .\n\nMust have building distributed data processing using Java, data frames, Strong backend developer.\n\nJob Description\n\nStrong hands-on knowledge of Python or Java as a distributed data developer, working on large data volumes (20m+ rows per day)\n\nAbility to deliver multiple simultaneous projects under pressure of regulatory driven deadlines\n\nStrong relational database experience with emphasis on data processing as described above\n\nStrong knowledge of database table partitions, data distribution, parallel loads and extracts working on DB2 DPF or Greenplum or other big data technologies\n\nBuild batch vs. event driven data processing. Design for high level of concurrency to ensure data integrity without compromising performance\n\nModeling and implementing database schemas\n\nComing up with system architecturere-design proposals for greater efficiency and ease of maintenance and developing software to turn proposals into implementations\n\nSkills Required\n\nStrong hands-on knowledge of Python or Java as a distributed data developer, working on large data volumes (20m+ rows per day)\n\nAbility to deliver multiple simultaneous projects under pressure of regulatory driven deadlines\n\n10+ years of relational database experience with emphasis on data processing as described above\n\nExcellent analytical ability\n\nStrong collaboration and communication skills."}, "5": {"title": "Desenvolvedor(a) Frontend React | Sênior (Remoto)", "description": "O Kyte\n\nO Kyte é um aplicativo para ajudar pequenos comerciantes a saírem do papel e da caneta e darem o primeiro passo na gestão e digitalização de seus negócios. O Kyte possui mais de 30 mil clientes ativos e cresce em ritmo acelerado. Estamos presentes em mais de 143 países, sendo principalmente, Brasil, EUA, México, demais países da América Latina e alguns países do Sudeste Asiático, como Filipinas e Malásia.\n\nDurante o ano de 2020 o Kyte provou ser uma ferramenta essencial para ajudar milhares de pequenos comércios que foram obrigados a fechar suas operações e passar para o Online. Assim, nossa base de clientes mais do que triplicou durante o ano de 2020 e não vamos desacelerar. Estamos captando investimento e temos planos para triplicar a equipe em 2021 que atualmente é de 30 pessoas.\n\nEstamos crescendo e precisamos de mais profissionais incríveis e apaixonados pelo que fazem, para fazer parte desse super time!\n\nA Kyte\n\nA Kyte é uma startup que nasceu em Florianópolis, mas atualmente está com o time todo distribuído (principalmente em Florianópolis e São Paulo). Nós temos uma grande ambição de atender cada vez mais clientes em todo o mundo. Ficamos felizes com as dezenas de depoimentos que chegam todos os dias contando como \"salvamos\" seus negócios. Estamos sempre pensando em melhorar, seja o produto, negócio, processos ou nós mesmos. Acreditamos que satisfação no trabalho é ter um grande desafio com as ferramentas adequadas e a visibilidade de que estamos sempre evoluindo. Somos ágeis e gostamos de uma comunicação pragmática e abundante, mas sempre com muito respeito. Sabemos que somente um time incrível de pessoas é capaz de grandes conquistas. Nosso código de cultura completo está disponível neste link (\n\nQuem procuramos\n\nPorém, Existem Alguns Atributos Que Não Podem Faltar\n\nAs competências necessárias para ser uma excelente pessoa programadora está mais conectado com perfil do que formação, então aceitamos candidatos com qualquer formação.\n\nDesenvolvedor(a) Front-end: com experiência, conhecimentos sólidos em componentização, onde os componentes criados sejam de fácil manutenção e com Design responsivo para aplicativo Android e iOS. Que tenha experiência em CSS e CSS in JS, pré processadores SASS e LESS, React e JSX, Redux e Javascript (ES6).\nPrecisa desenvolver com as melhores práticas utilizando metodologias para manter um código limpo e legível.\n\nPrazer em programar: você deve ter prazer genuíno em programar aplicativos. Ter interesse e curiosidade para entender de fato o produto e muita vontade em entregar a melhor solução.\n\nDinamismo: você abraça desafios e os vê como uma oportunidade para aprender ou executar algo novo. Você gosta também de apresentar suas ideias e está sempre disposto a encontrar novas maneiras de nos ajudar a crescer.\n\nCultura Kyte: We work hard and play to win. Somos uma startup em rápido crescimento, o clima é descontraído, mas de muita responsabilidade e desafios no dia a dia. Nosso time é de alta performance e movido por métricas e resultados. Buscamos qualidade em tudo o que fazemos e estamos sempre em busca do desenvolvimento pessoal. Também prezamos por transparência e honestidade.\n\nEssencial (Conhecimentos Sólidos)\nGit\nComponentização\nBoa modularização e reuso de código\nCSS e CSS in JS\nPré processadores SASS e LESS\nDesign responsivo\nJavascript (ES6)\nReact e JSX\nGerenciamento de estado (Redux)\nProgramação funcional\nSaber escrever lógica de negócio\nConsumo de API's REST\nDebugging\n\nDesejável / Diferencial\nReact-native\nIOS Swift\nAndroid\nExperiência com aplicações mobile\nPWA\nStorybook JS\n\nO que oferecemos\nContratação CLT;\nRemuneração mensal competitiva (nosso budget é flexível, você nos dirá quanto quer ganhar e analisaremos em relação ao mercado);\nTrabalho flexível, podendo ser 100% remoto ou híbrido entre remoto (de casa) e presencial em coworkings;\nVale-transporte Flexível - nos avise quando for para o escritório e o meio de transporte que irá utilizar (até R$20,00 por dia)\nAuxílio Home Office (R$ 150,00/mês para o trabalho remoto);\nEquipamentos - Iremos fornecer todos os itens para tornar o seu home office adequado e saudável (desde o notebook, até mesa e cadeira se necessário);\nDay off para o seu aniversário;\nHappy Hour Virtual, uma sexta-feira por mês (R$25,00);\nPlano de Saúde (após 3 meses);\nPlano Odontológico (após 3 meses);\nAuxílio Educação (após 3 meses);\nCartão multi-benefícios:\nVale-refeição ou alimentação: R$ 600,00;\nVale bem-estar (após 3 meses): R$ 80,00."}, "6": {"title": "Senior Python Developer | Top Start-up | Remote", "description": "Senior Python Developer | San Francisco/REMOTE | Fast-growing Tech Organization\n\nMy client, a fast-growing FinTech company based in San Francisco is looking for a talented Senior Python Developer to join their expanding team. They want passionate people that will come on board to work on their client site on exceptional projects and products.\n\nKey skills necessary are:\nExpertise in Python, ideally 5+ years\nStrong knowledge of Django\nExperience with AWS\nGreat testing practices\nAgile project management\nProven delivery methods and organisational skills\n\nThis is an excellent opportunity to work for a fast-growing Tech Organization.\n\nMy client is conducting interviews and on-boarding fully remotely. This role is based out of San Francisco, it is a fully-remote opportunity forever.\n\nExcellent salary, bonus and benefits on offer!\n\nSend in your details ASAP to find out more and receive a full job specification."}, "7": {"title": "Senior Python Developer", "description": "Project Description\n\nApplying to the position, you may join one of the most respected and fastest growing institutional investors in the world. Our client is a professional investment management organization that globally invests the funds to ensure long-term sustainability. The company invests in all major asset classes, including public equity, private equity, real estate, infrastructure and fixed-income instruments, and currently has offices in Toronto, London, Hong Kong, New York, São Paulo, Luxembourg and Mumbai.\nClient attracts and selects high-calibre individuals from top-tier institutions around the globe. Join our team and look forward to:\nDiverse and inspiring colleagues and approachable leaders\nStimulating work in a fast-paced, intellectually challenging environment\nAccelerated exposure and responsibility\nGlobal career development opportunities\nBeing motivated every day by important social purpose and unshakable principles\nA deeply rooted culture of Integrity, Partnership and High Performance\nIf you share a passion for performance, value a collegial and collaborative culture, and approach everything with the highest integrity, here's an opportunity.\n\nResponsibilities\nManage timelines/deliverables within the team towards the successful delivery of projects.\nDesign software solutions by interacting with portfolio managers, traders, operations staff and peers to understand requirements.\nDevelop solutions that are in line with client's technology biases, deliver efficiency and scalability, and enable new trading activities.\nProvide knowledge transfer to team members and support staff through application demos, walkthroughs, and documentation.\n\nSkills\n\nMust have\nUniversity degree in Engineering or Computer Science preferred\nProven track records in team leadership, managing development processes\nMust have good communication skills, strong client-facing skills and able to manage client's expectations\nStrong technical skills in Python, Performance tuning, NumPy, pylint/pytest, Pandas 6+ years\nStrong knowledge of SQL to be able to make queries, update structure and normalize data 3+ years\nGit, Jenkins, urbancode, liquibase, SonarQube 4+ years\nJira, Confluence - confident user\nAgile, Scrum framework 2+ years' experience on past projects\nNice to have\nCapital Markets domain experience\n\nLanguages\nEnglish: B2 Upper Intermediate"}, "8": {"title": "Senior Frontend Developer", "description": "The ideal candidate is a self-motivated, multi-tasker, and demonstrated team-player. Our CNN Digital Consumer Experience team has multiple levels of Front End Engineering opportunities. We are open to individuals being remote for our positions.\n\nOur CNN Digital Consumer business units includes CNN Politics, CNN Business and CNN Breaking News. All our web and mobile based business units.\n\nWhen it comes to technology stacks. We're open to individuals who have a wide variety of technology skill sets with different Front End Engineering.. Our preference is for individuals who have development experience in NodeJS, React, VueJS, Python, AWS, Serverless framework, and Terraform.\n\nIf you are interested please feel free to apply. Once our Technology Recruiter's will be in contact with you within 24 to 48 hours.\n\nThanks!"}, "9": {"title": "Senior Frontend Developer", "description": "About ShipHero\n\nHello. We are ShipHero (https://shiphero.com). We have built a software platform entrusted by hundreds of ecommerce companies, large and small to run their operations and we continue to grow. About US$5 billion of ecommerce orders are shipped a year via ShipHero. Many of our customers sell on Shopify, Amazon and many other platforms. We’re driven to help our customers grow their businesses by providing a platform that solves complex problems, and is engineered to be reliable and fast. We are obsessed with building great technology, that is beautiful, easy to use and is loved by our customers. Our culture also reflects our ethos and belief that by bringing passionate, talented and great people together - you can do great things.\nOur team is fully remote, with most of our engineers currently spread over the Americas but have been building out teams in Europe as well. We communicate regularly using video chat and Slack, and put a strong emphasis on asynchronous work so people have large chunks of uninterrupted time to focus and do deep work.\n\nAbout You\n\nYou understand that great things are accomplished when teams work together.\nYou’ve made a lot of mistakes, and most importantly, have learned from them.\nYou can code review other team members work and provide assistance and appreciate feedback.\nYou’ve learned from building systems and solutions the reasons to avoid technical debt, and how to approach and implement tests and CI practices.\n4+ years of experience writing Javascript, mostly with React\nYou are comfortable and even enjoy mentoring others in different skill-sets\n\nThe Role\n\nWork on a cross-functional team including backend and UX to build solutions that are easy for customers to understand, work consistently and scale well.\nReview features and requirements, design and implement solutions.\nUnderstand business requirements and think through solutions in terms of not just the coding implementation but also how the solution fits into the solution and how it solves a customer need.\nAbility to estimate effort and ship on agreed schedule.\nPerform regular code reviews, with the goal of code quality, good design and approach along with pushing engineers to improve and evolve.\nOptimize existing tech stack and solutions, determine path to next step in the evolution.\nLearn, and push those around you to do the same - this is a craft that you’re constantly improving upon.\nImplement solutions that are pragmatic to get the platform built.\nHave the confidence to work with experienced and talented people to just build great things, you’re not a “rock star”.\n\nPerks\n\n$2.500 so you can buy any equipment you need to be happy at your job\n20 days paid vacation + new year & Christmas\nConference days don't count against your vacation days, we want you to stay up-to-date\nWe will pay for courses & conferences, if you learn we all learn\nSalary range is wide since we're hiring for different seniority levels, the range is $60.000 - $90.000 / year depending on experience"}, "10": {"title": "Sr Python Developer", "description": "One of our largest clients, outside of the banks, is looking to bring on a Sr Python developer to sit sit remote. You would be part of a team doing greenfield development and creating a quality data ingestion engine.\nRequired Skills:\n• Backend development experience using one or more major languages, Python preferred\n• Frontend web development experience using Javascript, Angular preferred\n• Knowledgeable in data structures and SQL or no-SQL databases such as Dynamo DB or Mongo DB\n• CI/CD Pipeline Deployment\n• Understanding of object-oriented Programming\n• Experience in an AWS environment a plus"}, "11": {"title": "RoR Full Stack Developer opportunity with Insurance client! Virtual Interview, Immediate Remote Start!", "description": "Our Insurance client is seeking a qualified RoR Full Stack Developer with the following 3+ years of full stack development experience with the Ruby on Rails stack Experienced in ground up development and the full SDLC with the ability to create and advise on software development best practices Extensive use of HTML and CSS as well solid knowledge in the following frameworks, tools and libraries Stimulus.js, Turbolinks.js, ViewComponent, ag-Grid, and Tailwind CSS (preference for Stimulus.js\n\nTurbolinks.js) Background in quality coding and testing with preferred exposure to TDD (test driven development), static code checking, and projects looking to establish 100 test coverage\n\nSyfter is a staffing firm headquartered in Manhattan, NY, that provides creative solutions for clients and talent nationally. Our team of experts works tirelessly to create great connections industry-wide, and after decades in the industry, we deliver best-of-breed methodology for the best hiring experience."}, "12": {"title": "Sr, Lead. Architect Python Developer", "description": "Client: Banking\nTitle: Full Stack Python Developer\nLocation: Minneapolis, MN OR Phoenix, AZ or other multiple locations- Initially remote - Must relocation post COVID\nDuration: Direct Hire/Permanent\n$100k - 200k/yr (depending on years of experience)\n Locations: candidate could sit are-\n·        Minneapolis, MN\n·        Des Moines, IA\n·        Chicago, IL\n·        Raleigh, NC\n·        Dallas, TX\n·        Phoenix, AZ\n "}, "13": {"title": "Python Developer-Remote (3668)", "description": "Flexion Inc. a Madison, WI based IT Consulting and Services firm is looking for a Python Developer to work on a remote consulting project. The client for this position is based in Raleigh, NC but the work can be done remotely from anywhere in the United States. Initial duration of this work is in the 5-6 month range with the potential for extension.\n\n\n\nThe most efficient way to reach our recruiting team is to submit your resume through the URL provided. If you have questions or would like more information about this job posting, or if would like to know more about Flexion Inc. please contact Chris Giese 608-837-6411.\n\n\n\nThis person will work as part of a small team doing Python Development to build a data integration management application for scientific data.\n\n\n\nRequired skills:\n\n-Three years of Python Development experience\n\n-Experience with Web Frameworks such as Flask or Django.\n\nHelpful experience for this role includes: working in a regulated scientific environment and within a clinical data program.\n\n\n\n\n\nEqual Employment Opportunity/Affirmative Action Employer"}, "14": {"title": "Senior Python Developer", "description": "POSITION IS FULLY REMOTE THROUGH COVID-19\n\nJOB AT A GLANCE: \n\n\n\nAmpersand is seeking Senior Python Developer to help grow The AND Platform – Ampersand’s first step in bringing automation and simplicity to audience-based TV buying, for both local or national campaigns, in a single interface. The ideal candidate has extensive experience developing data intensive software as part of a data science or machine learning engineering group. We make extensive use of Bayesian methods (PyMC3) so our model deployments are fairly computationally intensive. This role allows for great opportunity to work in a startup-like environment within a larger company and create impact by partnering with teams across the organization.\n\nFor more information on The AND Platform, watch here: https://vimeo.com/386712360\nESSENTIAL FUNCTIONS: \n\nSoftware design, testing, and maintenance in Python\n\nEDUCATION, SKILLS AND EXPERIENCE:\n\nAbility to communicate and collaborate with stakeholders across Ampersand and to present clear oral and written arguments\nDegree in quantitative field like math, statistics, operations research, economics, or physics\nAdvanced degree or equivalent experience preferred\n4+ years of experience as a data scientist\n\nWe are looking for a Python expert comfortable independently leading software development projects from start to tested completion. We use git for version control and expect that the candidate will have significant experience with git-based workflows.\n\nYou can review an example of the kind of code we write here: https://github.com/ampersandtv/pymc3-hmm\n\nExperience with the following technologies/practices is preferred but not required:\n\nAWS\nCI/CD\nKubernetes\nMonitoring/Logging\nSQL\nColumnar storage databases, e.g. clickhouse and redshift\n\nWe work extensively with the following Python libraries so any experience with them will be beneficial:\n\ndask\npymc3/theano/arviz\nnumpy/scipy/pandas\npytest\nfastapi\nBENEFITS: Ampersand offers a competitive salary plus benefits package including medical, dental, & vision plans, (PTO) paid time off, 401K, & tuition reimbursement. Please visit our website at https://ampersand.tv for more information on our products and services.\n\nAmpersand welcomes all qualified applicants to apply without regard to race, color, nationality, gender, gender identity or expression, sexual orientation, religion, disability or age. We are an equal opportunity employer committed to belonging, equity and diversity. "}, "15": {"title": "Sr JavaScript/Front End Developer - 100% REMOTE!", "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Trident Solutions, is seeking the following. Apply via Dice today!\n\nThis is a 100 remote position. Sr JavaScriptFront-End Developer We are seeking strong JavaScript and related front-end skills. HTML and JS frameworks (can be Vue.JS or React, etc) are also required. This is a long-term fully remote contract position. REQUIRED Minimum 7 Years JavaScript Minimum 7 years HTML PREFERRED (NOT Required!) 2 years Java Jenkins or Urban Code Deployment experience JOB DESCRIPTION Acting as an internal consultant, advocate, mentor, and change agent, plan, design, and develop the most complex and business critical software solutions, utilizing appropriate software development methodologies either individually or as part of a project team. Responsible for ensuring that browser-based systems and applications meet client requirements and operate properly, using software development methodologies."}, "16": {"title": "REMOTE Sr Front End Developer", "description": "Our agency client is seeking a talented freelance Sr Front End Developer to join their team for 6 – 12 months!\n\nThis is a fully remote opportunity.\n\nSr Front End Developer Responsibilities\nAssist with the conversion of customer facing websites from Angular to React\nEnhance and expand merchant portals (using React, SASS and Storybook)\nCollaborate with a team to build a React component library and SASS style guide with Storybook\nAdding features to websites\nSr Front End Developer Requirements\n6+ Years of Front End Development experience – specifically building single web page apps using modern technologies like: React, JavaScript, AngularJS, SASS,HTML5, Git, etc\nMUST HAVE - Strong experience in React, JavaScript, SASS, and AngularJS\nStrong understanding of UX and accessibility\nExperience working in an agile environment\nAPR. 2021\n\nSubmit resume (and samples if applicable) to: cc120@jobalert.creativecircle.com\n\nFor Creative Circle to represent candidates for freelance opportunities, applicants must be currently authorized to work in the United States without the need of employer sponsorship for a non-immigrant visa."}, "17": {"title": "Senior Frontend Developer", "description": "Senior Frontend Developer\nNorth American Bancard - Remote\nThe Senior Frontend Developer will have a track record of positive development work product and is able to work with teams that are remote. The engineer we are looking for must be self-disciplined, passionate about innovation, and committed to a positive customer experience. In this role, you will provide consultation on large, complex frontend projects and a wide degree of creativity and latitude is expected.\n\nWhat you'll be doing: \nWorking on a team of remote senior engineers to create next gen web based POS systems\nManaging large frontend projects\nDesign, testing, and debugging new code & features\n\nWhat we need from you:\n10 years experience as a software engineer \nExperience with the following:\nTypeScript (required)\nJavaScript (required)\nCSS (required)\nUnit Testing Frontend code (required)\nReactJS (required)\nNodeJS (required)\nMaterial UI (desired)\nWebpack (desired)\nJest (desired)\nAWS experience (desired)\n\n\nThis position is 100% remote open to any time zone in continental United States.\n\n\nSalary: $93,000+ (based on experience) \nBenefits included: Medical, Dental, Vision, 401k + match, etc.\n\nAt North American Bancard Holdings, LLC (NAB) our vision is a new paradigm of commerce that simplifies the modern business model — driving smarter operations, enhancing security, and fostering effortless personal interaction between merchants and their customers. Throughout our growth, we've stayed agile in order to stay at the forefront of the ever-changing payments landscape. While we are large enough to offer customized solutions to enterprise-level clients we're still nimble enough to take an award-winning, hands-on approach to personal service you just won't find anyplace else.\nAt North American Bancard, we celebrate diversity and create an inclusive environment for everyone. We are an equal opportunity employer."}, "18": {"title": "Software Engineer, Developer Experience", "description": "Company Description\n\nSquare builds common business tools in unconventional ways so more people can start, run, and grow their businesses. When Square started, it was difficult and expensive (or just plain impossible) for some businesses to take credit cards. Square made credit card payments possible for all by turning a mobile phone into a credit card reader. Since then Square has been building an entire business toolkit of both hardware and software products including Square Capital, Square Terminal, Square Payroll, and more. We’re working to find new and better ways to help businesses succeed on their own terms—and we’re looking for people like you to help shape tomorrow at Square.\n\nJob Description\n\nOur Developer Experience (DX) team within Device Software Engineering, looks across the software development life cycle to find opportunities to help speed up delivery and improve the quality of our Hardware and Software products. We are looking for someone to build and architect the next generation of our Python testing framework for Square hardware products. You will report to our Engineering Manager, Developer Experience.\n\nYou Will\nBuild and own Python tooling and frameworks to accelerate hardware development\nCreate and own new tools to debug and develop Square's hardware products\nBe a technical mentor for other engineers on DX\n\nYou Have\n\nQualifications\n8+ years of software development experience\nExpertise in Python development, packaging, release and best practices\nThe desire to work across team boundaries with your partners such as; Android and Embedded Product teams\nEven better if you have experience in any of the following:\nPytest\nDesigning and developing automated tests and CI processes for hardware products\nDeveloping virtualized build environments for developing hardware products\n\nAdditional Information\n\nAt Square, we value diversity and always treat all employees and job applicants based on merit, qualifications, competence, and talent. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)squareup.com. We will treat your request as confidentially as possible. In your email, please include your name and preferred method of contact, and we will respond as soon as possible.\n\nPerks\n\nAt Square, we want you to be well and thrive. Our global benefits package includes:\nHealthcare coverage\nRetirement Plans\nEmployee Stock Purchase Program\nWellness perks\nPaid parental leave\nPaid time off\nLearning and Development resources"}, "19": {"title": "Junior Python Engineer (Remote in US)", "description": "Company Description\n\nThresher's products create value from unstructured text--even when others are trying to manipulate the narrative. Thresher is the result of a collaboration between engineers, data scientists, former intelligence officers, and business executives who understand the needs of experts conducting high stakes analysis in the private and public sectors. We are growing our engineering team as we wrestle with the complex, multidisciplinary challenges that we are helping our clients address.\n\nJob Description\n\nWhat You’ll Do:\nParticipate in the software development life cycle including development, testing, maintenance, and support.\nOperate in a collaborative agile environment with a focus on transparency and team success.\nCreate proofs-of concept, prototypes, and production-quality solutions.\nExtract, transform, and load (ETL) text data in a variety of written languages.\nEngage with peers to review solutions and help ensure our team delivers readable, maintainable, and extensible solutions.\nCollaborate with subject matter experts and data scientists to fully understand requirements and participate in proposing solutions.\nQualifications\n\nIdeal Candidate Has\nInterest in software engineering best practices\nInterest in authoring well-structured and testable code\nFamiliarity with Python\nFamiliarity with relational databases\nInterest in Scrum and agile methodologies\nExperience in learning new technologies, techniques, and practices\nRelevant internship experience\nAttributes That Are Important To Us\nCommitment to delivering high-quality solutions\nEnthusiasm for problem-solving\nInterest and ability to take initiative\nAbility to communicate and collaborate in a diverse and distributed team\nAbility to convey complex topics concisely and clearly\nAbility and willingness to learn new things\nAbility to succeed in a remote work environment\nAdditional Information\n\nCompensation\n\nis competitive and includes 20 days of vacation, 9 federal holidays, 9 days of sick leave. We cover 100% of health care premiums as well as the premiums for short and long-term disability plus life insurance. We will contribute to your 401K. This is a great opportunity to collaborate on a team with diverse data and social science experience, and work on challenging technical problems in the national security space with dual applications in the commercial sector.\n\nAll applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy, gender identity, and sexual orientation), national origin, disability, age (age 40 or older), or genetic information. We welcome applications from veterans.\n\nIf you are interested, please submit a cover letter describing a challenging problem you solved, why you are interested in working with Thresher, and a resume."}, "20": {"title": "Python Developer", "description": "Python with Django - Fulltime - Remote EST hours\n\nResponsibilities\nWriting reusable, testable, and efficient code.\nDevelop new features and improve existing features of the software.\nPerformance improvements, maintenance and bug fixes.\nContribute to team and organizational improvements in process and infrastructure. Code, test and operate Python based services and applications.\n Requirements\n7+ years of Python development engineering experience – need to have strong corporate project experience\n2+ years Django – must be real corporate project experience\nFamiliarity with modern client-side web technologies javascript - React /\nSmall team experience – must be able to work autonomously\n\nPreferred\nVersion control tool - GitHub\nClean code base covered with tests; Unit testing or CI\n "}, "21": {"title": "Python Developer", "description": "Immediate need for a talented Python Developer. This is a Contract to Hire (CTH) employment opportunity and is Remote. Please review the job description below:\n\nTechnology We Use:\nPython, Terraform, Amazon Web Services, Github, NewRelic, Pagerduty\n\nWhat We Look For:\nProficient experience in Python or comparable Java experiences and able to quickly learn Python.\nStrong analytical and problem-solving skills.\nStrong Software Design patterns and industry best practices.\nProven ability to work independently and as part of a team; designing, developing and deploying solutions, and to deliver projects on time with minimal direction\nAWS infrastructure experience\nEnd-to-end ownership of product design to delivery.\nExperience working in an agile team.\nPassionate technologists with an innovative mindset."}, "22": {"title": "Software Engineer (C++, JavaScript, Python) Boston - 130k-180k", "description": "This position is for an experienced Software Engineer with a passion for the quality of their code and a desire to work for an organization that is truly making a difference in the medical device space. You will interact with all aspects of their instrument and probe design stack. You will work on instrument system level software, UI development, and data model design.\n\nClient Details\n\nThe company are developing next-generation technology in the medical diagnostics space and they're a start-up organization that recently received their Series A funding.\n\nDescription\n\nThe team are looking for someone to interact with all aspects of their instrument and probe design stack. You will work on instrument system level software, UI development, and data model design. If you care about fault tolerance of your code, then you will enjoy working on this software team\n\nProfile\n\nThe successful candidate will have experience with:\n\n- UI Development\n- C, C++\n- JavaScript\n- Python\n- React or Vue\n- Robotics/Med Device/Biotech experience is nice to have but not essential\n\nJob Offer\n\nThe company offers a flexible work environment!\n\nCompensation details include:\n\nA fantastic base salary depending on experience\nUnlimited PTO\nMedical/Dental/Vision\nEquity\nDesired Skills and Experience\n\n- UI Development\n- C, C++\n- JavaScript\n- Python\n- React or Vue\n- Robotics/Med Device/Biotech experience is nice to have but not essential"}, "23": {"title": "Senior Python Developer", "description": "Rogue Talent is hiring a Senior Python Developer / Machine Learning Engineer to join a fast-paced team endeavoring to enhance & improve public-facing API and Workflow Management and Monitoring System. This exciting hiring client is a pre-seed AI security startup delivering sophisticated tools to safely build and deploy next-gen Artificial General Intelligence backed applications. They are committed to delivering ensuring the long-term security and integrity of the emerging ML/AI technologies of tomorrow. Their leadership consists of battle-hardened, proven engineers and tech evangelists with a successful track record of building and scaling data- and AI-centric platforms and companies.\n\nQualifications:\nMust be very familiar with Python 3\nMust have experience with Python’s asynchronous libraries and tools\nMust be familiar with message bus and pub/sub data processing environments\nMust be well-versed in Git and Docker\nMust have a great attitude, enjoy learning new things, and love sharing them with peers\nMust be flexible and able to adapt to a fast-paced quickly changing startup environment\n\nBonus Points:\nFastAPI\nKafka and/or Faust\nNatural Language Processing (NLP)\nPostgreSQL\nRedis\nGPT3\nOpenAI, HuggingFace and/or Eleuther\n\nComp Package:\n$125-150K\nEquity options (at the ground floor!)\nHealthcare benefits via Gusto\n100% remote, tech tools provided\n\nRogue Talent and its proud portfolio of hiring clients are equal opportunity recruiters & employers. In accordance with anti-discrimination law, it is the purpose of this policy to effectuate these principles and mandates. Our alliance prohibits discrimination and harassment of any type and affords equal employment opportunities to employees and applicants without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law. We conform to the spirit as well as to the letter of all applicable laws and regulations."}, "24": {"title": "Python Fullstack Developer", "description": "Our client is an explosive startup within the pharma space that is looking to add IT professionals to their growing offices. The company we represent is dedicated to transformative developments within the healthcare industry. Our client is looking to identify a Full Stack Python Developer to build web components for the company’s Data Warehouse.\n\nWhat You Will Get:\n-Competitive compensation package\n-Start-up environment that breeds innovation\n-Autonomy within the role\n\nWhat You Will Do as a Full Stack Python Developer:\n-Full stack web development\n-Database, ETL, Reporting\n-Work on web services and web UI pieces\n\nWhat You Will Need as a Full Stack Python Developer:\n-BS degree in Computer Science or related field preferred\n-6+ years of web development experience\n-Experience with Flask and/or Django preferred\n\nOur client is not offering relocation packages.\nOur client is unable to transfer or sponsor visas at this time."}}